-- Практическое задание 1.3. Вариант 7. Вставка данных.
-- Запросы к схеме exam.

-- 1. Добавить нового преподавателя.
INSERT INTO exam."Teachers" ("Id", "FullName")
VALUES ('a2000001-0000-4000-8000-000000000009', 'Сидорова Светлана Михайловна');

-- 2. Добавить новый экзамен.
INSERT INTO exam."ExamSessions" ("Id", "StudentGroupId", "SubjectId", "ExamDate", "TeacherId", "AssessmentType")
VALUES ('a5000001-0000-4000-8000-000000000017',
        'a3000001-0000-4000-8000-000000000001',
        'a4000001-0000-4000-8000-000000000001',
        DATE '2026-06-20',
        'a2000001-0000-4000-8000-000000000001',
        'Экзамен');
